{
    "example": "Context",
    "example_1": "Initially there are six objects, five static and one dynamic object. The static objects are teal aluminium cube, purple cardboard cube, teal cardboard sphere, teal cardboard cube, olive aluminium sphere, purple aluminium sphere, The dynamic purple aluminium sphere collides with the teal cardboard cube.It is moving in the  direction and collides with the teal cardboard cube. After the collision the purple aluminium sphere moves in  and teal cardboard cube moves in North direction.  The teal aluminium cube collides with the purple cardboard cube. The teal aluminium cube moves in the  and the purple cardboard cube moves in the  direction. The teal aluminium cube collides with the teal cardboard sphere. The teal aluminium cube moves in the  and the teal cardboard sphere moves in the  direction. The teal cardboard sphere collides with the teal aluminium cube. The teal cardboard sphere moves in the North and the teal aluminium cube moves in the  direction. ",
    "example_10": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, purple cardboard cube, olive cardboard sphere, teal cardboard sphere, purple aluminium cube, The dynamic purple aluminium cube collides with the teal cardboard sphere.It is moving in the West direction and collides with the teal cardboard sphere. After the collision the purple aluminium cube moves in West and olive cardboard sphere moves in Southwest direction.  The olive cardboard sphere collides with the purple cardboard cube. The olive cardboard sphere moves in the Southwest and the purple cardboard cube moves in the  direction. The olive cardboard sphere collides with the teal aluminium cube. The olive cardboard sphere moves in the  and the teal aluminium cube moves in the  direction. ",
    "example_11": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, olive cardboard sphere, purple aluminium cube, purple cardboard cube, olive aluminium sphere, purple cardboard sphere, The dynamic purple cardboard cube collides with the olive cardboard sphere.It is moving in the Southwest direction and collides with the olive cardboard sphere. After the collision the purple cardboard cube moves in Southwest and olive cardboard sphere moves in West direction.  The olive cardboard sphere collides with the purple cardboard sphere. The olive cardboard sphere moves in the West and the purple cardboard sphere moves in the South direction. ",
    "example_12": "Initially there are six objects, five static and one dynamic object. The static objects are purple cardboard cube, olive cardboard sphere, teal aluminium sphere, olive cardboard cube, purple cardboard sphere, purple aluminium cube, The dynamic purple cardboard sphere collides with the olive cardboard sphere.It is moving in the  direction and collides with the olive cardboard sphere. After the collision the teal aluminium sphere moves in South and olive cardboard sphere moves in  direction.  The purple cardboard sphere collides with the teal aluminium sphere. The purple cardboard sphere moves in the  and the teal aluminium sphere moves in the  direction. ",
    "example_13": "Initially there are six objects, five static and one dynamic object. The static objects are teal aluminium cube, teal aluminium sphere, teal cardboard cube, teal cardboard sphere, olive cardboard sphere, olive aluminium sphere, The dynamic teal aluminium cube collides with the olive cardboard sphere.It is moving in the  direction and collides with the olive cardboard sphere. After the collision the teal aluminium cube moves in  and olive cardboard sphere moves in  direction.  The olive cardboard sphere collides with the olive aluminium sphere. The olive cardboard sphere moves in the  and the olive aluminium sphere moves in the  direction. ",
    "example_14": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, teal aluminium sphere, purple cardboard sphere, olive cardboard sphere, purple aluminium cube, The dynamic olive cardboard sphere collides with the purple cardboard sphere.It is moving in the South direction and collides with the purple cardboard sphere. After the collision the purple aluminium cube moves in  and purple cardboard sphere moves in  direction.  The purple cardboard sphere collides with the teal aluminium sphere. The purple cardboard sphere moves in the  and the teal aluminium sphere moves in the  direction. ",
    "example_15": "Initially there are six objects, five static and one dynamic object. The static objects are purple cardboard cube, olive aluminium cube, teal cardboard sphere, olive cardboard cube, teal aluminium sphere, olive aluminium sphere, The dynamic olive aluminium sphere collides with the teal aluminium sphere.It is moving in the Southwest direction and collides with the teal aluminium sphere. After the collision the olive aluminium sphere moves in Southwest and teal aluminium sphere moves in  direction.  ",
    "example_16": "Initially there are six objects, five static and one dynamic object. The static objects are purple cardboard cube, olive aluminium cube, teal cardboard sphere, purple aluminium cube, olive aluminium sphere, teal aluminium sphere, The dynamic olive aluminium sphere collides with the olive aluminium cube.It is moving in the Southwest direction and collides with the olive aluminium cube. After the collision the olive aluminium cube moves in Southwest and purple aluminium cube moves in North direction.  The purple cardboard cube collides with the teal aluminium sphere. The purple cardboard cube moves in the  and the teal aluminium sphere moves in the  direction. ",
    "example_17": "Initially there are six objects, five static and one dynamic object. The static objects are teal aluminium cube, purple cardboard cube, purple aluminium cube, purple aluminium sphere, teal cardboard cube, olive cardboard cube, The dynamic teal aluminium cube collides with the purple cardboard cube.It is moving in the Northwest direction and collides with the purple cardboard cube. After the collision the purple aluminium sphere moves in West and purple cardboard cube moves in North direction.  The purple cardboard cube collides with the purple aluminium sphere. The purple cardboard cube moves in the North and the purple aluminium sphere moves in the West direction. The purple cardboard cube collides with the purple aluminium cube. The purple cardboard cube moves in the North and the purple aluminium cube moves in the  direction. The purple aluminium cube collides with the olive cardboard cube. The purple aluminium cube moves in the West and the olive cardboard cube moves in the  direction. ",
    "example_18": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, teal cardboard sphere, purple aluminium sphere, teal aluminium sphere, olive cardboard sphere, The dynamic olive cardboard sphere collides with the purple aluminium sphere.It is moving in the South direction and collides with the purple aluminium sphere. After the collision the purple aluminium cube moves in West and olive cardboard cube moves in  direction.  ",
    "example_19": "Initially there are six objects, five static and one dynamic object. The static objects are olive cardboard sphere, olive aluminium sphere, purple aluminium cube, teal cardboard cube, purple aluminium sphere, purple cardboard sphere, The dynamic olive aluminium sphere collides with the purple aluminium cube.It is moving in the Southwest direction and collides with the purple aluminium cube. After the collision the olive aluminium sphere moves in Southwest and purple aluminium cube moves in North direction.  ",
    "example_20": "Initially there are six objects, five static and one dynamic object. The static objects are teal cardboard sphere, purple cardboard cube, olive cardboard sphere, teal aluminium sphere, purple cardboard sphere, olive aluminium sphere, The dynamic olive cardboard sphere collides with the purple cardboard cube.It is moving in the West direction and collides with the purple cardboard cube. After the collision the olive cardboard sphere moves in Northwest and purple cardboard cube moves in  direction.  The purple cardboard cube collides with the teal cardboard sphere. The purple cardboard cube moves in the South and the teal cardboard sphere moves in the  direction. ",
    "example_21": "Initially there are five objects, four static and one dynamic object. The static objects are teal cardboard cube, olive cardboard sphere, purple aluminium cube, teal aluminium sphere, olive aluminium sphere, The dynamic olive cardboard sphere collides with the purple aluminium cube.It is moving in the Southeast direction and collides with the purple aluminium cube. After the collision the olive cardboard sphere moves in  and purple aluminium cube moves in South direction.  ",
    "example_22": "Initially there are five objects, four static and one dynamic object. The static objects are purple cardboard cube, teal cardboard sphere, purple aluminium cube, teal aluminium cube, olive cardboard sphere, The dynamic olive cardboard sphere collides with the teal aluminium cube.It is moving in the Southwest direction and collides with the teal aluminium cube. After the collision the teal aluminium cube moves in  and purple cardboard cube moves in North direction.  The olive cardboard sphere collides with the purple aluminium cube. The olive cardboard sphere moves in the South and the purple aluminium cube moves in the  direction. ",
    "example_23": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, purple cardboard cube, purple cardboard sphere, teal cardboard sphere, olive aluminium sphere, The dynamic olive aluminium sphere collides with the teal aluminium cube.It is moving in the Southeast direction and collides with the teal aluminium cube. After the collision the olive aluminium sphere moves in Southeast and teal aluminium cube moves in North direction.  The teal aluminium cube collides with the purple cardboard cube. The teal aluminium cube moves in the South and the purple cardboard cube moves in the  direction. ",
    "example_24": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, olive cardboard sphere, purple cardboard sphere, purple aluminium sphere, teal aluminium sphere, The dynamic teal aluminium cube collides with the purple cardboard sphere.It is moving in the Northeast direction and collides with the purple cardboard sphere. After the collision the olive cardboard sphere moves in  and teal aluminium sphere moves in  direction.  The teal aluminium cube collides with the olive cardboard sphere. The teal aluminium cube moves in the North and the olive cardboard sphere moves in the  direction. ",
    "example_25": "Initially there are six objects, five static and one dynamic object. The static objects are purple cardboard cube, olive cardboard cube, teal cardboard sphere, purple aluminium cube, purple aluminium sphere, teal aluminium sphere, The dynamic purple aluminium cube collides with the teal cardboard sphere.It is moving in the Northeast direction and collides with the teal cardboard sphere. After the collision the purple aluminium cube moves in North and teal cardboard sphere moves in Northwest direction.  The teal cardboard sphere collides with the teal aluminium sphere. The teal cardboard sphere moves in the North and the teal aluminium sphere moves in the  direction. The teal cardboard sphere collides with the purple cardboard cube. The teal cardboard sphere moves in the  and the purple cardboard cube moves in the  direction. The purple aluminium cube collides with the olive cardboard cube. The purple aluminium cube moves in the West and the olive cardboard cube moves in the West direction. ",
    "example_26": "Initially there are five objects, four static and one dynamic object. The static objects are purple cardboard cube, teal cardboard cube, purple cardboard sphere, teal aluminium cube, purple aluminium sphere, The dynamic purple aluminium sphere collides with the teal cardboard cube.It is moving in the Southwest direction and collides with the teal cardboard cube. After the collision the purple aluminium sphere moves in South and teal cardboard cube moves in West direction.  ",
    "example_27": "Initially there are six objects, five static and one dynamic object. The static objects are purple cardboard cube, teal aluminium cube, olive cardboard cube, purple aluminium sphere, teal cardboard sphere, teal cardboard cube, The dynamic purple aluminium sphere collides with the teal cardboard cube.It is moving in the West direction and collides with the teal cardboard cube. After the collision the teal aluminium cube moves in  and teal cardboard cube moves in Northwest direction.  The purple cardboard cube collides with the teal aluminium cube. The purple cardboard cube moves in the  and the teal aluminium cube moves in the  direction. ",
    "example_28": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, teal cardboard cube, olive cardboard cube, purple aluminium sphere, olive cardboard sphere, The dynamic purple aluminium sphere collides with the olive cardboard sphere.It is moving in the Southwest direction and collides with the olive cardboard sphere. After the collision the purple aluminium sphere moves in Southwest and olive cardboard cube moves in South direction.  ",
    "example_29": "Initially there are five objects, four static and one dynamic object. The static objects are olive aluminium cube, olive aluminium sphere, purple cardboard sphere, purple aluminium cube, teal aluminium sphere, The dynamic purple aluminium cube collides with the purple cardboard sphere.It is moving in the North direction and collides with the purple cardboard sphere. After the collision the purple aluminium cube moves in Northwest and purple cardboard sphere moves in North direction.  The purple cardboard sphere collides with the olive aluminium sphere. The purple cardboard sphere moves in the Northeast and the olive aluminium sphere moves in the  direction. The purple cardboard sphere collides with the olive aluminium cube. The purple cardboard sphere moves in the Northeast and the olive aluminium cube moves in the West direction. The purple cardboard sphere collides with the teal aluminium sphere. The purple cardboard sphere moves in the North and the teal aluminium sphere moves in the West direction. ",
    "example_3": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, olive cardboard sphere, purple cardboard cube, purple aluminium cube, teal aluminium sphere, The dynamic purple aluminium cube collides with the purple cardboard cube.It is moving in the Northwest direction and collides with the purple cardboard cube. After the collision the purple aluminium cube moves in Northwest and purple cardboard cube moves in West direction.  The purple aluminium cube collides with the teal aluminium cube. The purple aluminium cube moves in the Northwest and the teal aluminium cube moves in the Northwest direction. The teal aluminium cube collides with the olive cardboard sphere. The teal aluminium cube moves in the West and the olive cardboard sphere moves in the West direction. ",
    "example_30": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, purple cardboard sphere, olive cardboard sphere, teal cardboard sphere, teal cardboard cube, teal aluminium cube, The dynamic olive cardboard sphere collides with the teal aluminium cube.It is moving in the South direction and collides with the teal aluminium cube. After the collision the teal cardboard cube moves in  and teal aluminium cube moves in  direction.  The olive cardboard sphere collides with the purple cardboard sphere. The olive cardboard sphere moves in the South and the purple cardboard sphere moves in the South direction. ",
    "example_31": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, olive cardboard cube, olive aluminium sphere, purple cardboard sphere, purple aluminium cube, teal cardboard cube, The dynamic olive aluminium sphere collides with the olive cardboard cube.It is moving in the  direction and collides with the olive cardboard cube. After the collision the purple aluminium cube moves in  and olive cardboard cube moves in  direction.  The olive cardboard cube collides with the purple aluminium cube. The olive cardboard cube moves in the  and the purple aluminium cube moves in the  direction. ",
    "example_33": "Initially there are five objects, four static and one dynamic object. The static objects are teal aluminium cube, olive aluminium sphere, teal cardboard sphere, olive cardboard cube, olive cardboard sphere, The dynamic teal cardboard sphere collides with the olive cardboard sphere.It is moving in the Southwest direction and collides with the olive cardboard sphere. After the collision the teal cardboard sphere moves in West and olive cardboard sphere moves in Southwest direction.  The olive cardboard sphere collides with the olive cardboard cube. The olive cardboard sphere moves in the Southwest and the olive cardboard cube moves in the South direction. The olive cardboard sphere collides with the olive aluminium sphere. The olive cardboard sphere moves in the West and the olive aluminium sphere moves in the  direction. ",
    "example_34": "Initially there are five objects, four static and one dynamic object. The static objects are olive aluminium sphere, purple cardboard cube, olive cardboard cube, teal aluminium sphere, teal cardboard cube, The dynamic purple cardboard cube collides with the olive cardboard cube.It is moving in the North direction and collides with the olive cardboard cube. After the collision the purple cardboard cube moves in North and olive cardboard cube moves in West direction.  The olive cardboard cube collides with the olive aluminium sphere. The olive cardboard cube moves in the South and the olive aluminium sphere moves in the  direction. ",
    "example_35": "Initially there are five objects, four static and one dynamic object. The static objects are purple cardboard cube, olive aluminium cube, purple aluminium sphere, olive cardboard sphere, teal aluminium cube, The dynamic olive cardboard sphere collides with the purple cardboard cube.It is moving in the Northeast direction and collides with the purple cardboard cube. After the collision the olive cardboard sphere moves in Northeast and purple cardboard cube moves in Northeast direction.  The olive aluminium cube collides with the teal aluminium cube. The olive aluminium cube moves in the  and the teal aluminium cube moves in the  direction. ",
    "example_37": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, purple aluminium sphere, olive cardboard cube, teal cardboard sphere, teal cardboard cube, purple aluminium cube, The dynamic purple aluminium sphere collides with the olive aluminium cube.It is moving in the North direction and collides with the olive aluminium cube. After the collision the olive cardboard cube moves in  and olive aluminium cube moves in  direction.  The olive aluminium cube collides with the purple aluminium cube. The olive aluminium cube moves in the Northwest and the purple aluminium cube moves in the  direction. ",
    "example_38": "Initially there are five objects, four static and one dynamic object. The static objects are olive aluminium cube, purple aluminium sphere, purple aluminium cube, olive aluminium sphere, teal aluminium sphere, The dynamic purple aluminium cube collides with the olive aluminium cube.It is moving in the  direction and collides with the olive aluminium cube. After the collision the purple aluminium cube moves in  and olive aluminium cube moves in  direction.  The olive aluminium cube collides with the purple aluminium sphere. The olive aluminium cube moves in the  and the purple aluminium sphere moves in the  direction. The olive aluminium cube collides with the teal aluminium sphere. The olive aluminium cube moves in the  and the teal aluminium sphere moves in the Northeast direction. The teal aluminium sphere collides with the olive aluminium sphere. The teal aluminium sphere moves in the  and the olive aluminium sphere moves in the West direction. ",
    "example_40": "Initially there are five objects, four static and one dynamic object. The static objects are purple cardboard cube, purple aluminium sphere, teal aluminium sphere, purple aluminium cube, olive cardboard sphere, The dynamic olive cardboard sphere collides with the purple aluminium cube.It is moving in the South direction and collides with the purple aluminium cube. After the collision the teal cardboard cube moves in  and olive cardboard cube moves in Southeast direction.  ",
    "example_41": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, teal aluminium cube, teal aluminium sphere, teal cardboard sphere, teal cardboard cube, olive aluminium sphere, The dynamic olive aluminium sphere collides with the teal cardboard cube.It is moving in the  direction and collides with the teal cardboard cube. After the collision the olive aluminium cube moves in  and teal cardboard cube moves in  direction.  ",
    "example_42": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, olive cardboard cube, teal cardboard cube, olive aluminium sphere, purple aluminium cube, purple aluminium sphere, The dynamic olive aluminium sphere collides with the olive aluminium cube.It is moving in the Southwest direction and collides with the olive aluminium cube. After the collision the olive aluminium sphere moves in Southwest and purple aluminium sphere moves in South direction.  The olive aluminium sphere collides with the olive cardboard cube. The olive aluminium sphere moves in the West and the olive cardboard cube moves in the North direction. ",
    "example_43": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium sphere, purple cardboard cube, olive cardboard sphere, teal cardboard sphere, purple aluminium cube, teal cardboard cube, The dynamic teal cardboard cube collides with the purple aluminium cube.It is moving in the  direction and collides with the purple aluminium cube. After the collision the teal cardboard cube moves in  and purple aluminium cube moves in  direction.  The teal cardboard sphere collides with the olive cardboard sphere. The teal cardboard sphere moves in the  and the olive cardboard sphere moves in the North direction. ",
    "example_44": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, olive cardboard cube, purple cardboard cube, purple aluminium cube, teal cardboard cube, purple cardboard sphere, The dynamic purple cardboard cube collides with the purple cardboard sphere.It is moving in the  direction and collides with the purple cardboard sphere. After the collision the olive aluminium cube moves in  and purple cardboard sphere moves in  direction.  The olive cardboard cube collides with the olive aluminium cube. The olive cardboard cube moves in the  and the olive aluminium cube moves in the  direction. The teal cardboard cube collides with the olive cardboard cube. The teal cardboard cube moves in the  and the olive cardboard cube moves in the  direction. ",
    "example_45": "Initially there are six objects, five static and one dynamic object. The static objects are teal cardboard cube, olive cardboard sphere, purple aluminium cube, teal aluminium sphere, olive aluminium sphere, purple cardboard cube, The dynamic purple cardboard cube collides with the teal cardboard cube.It is moving in the Southeast direction and collides with the teal cardboard cube. After the collision the purple cardboard cube moves in South and teal cardboard cube moves in  direction.  ",
    "example_46": "Initially there are six objects, five static and one dynamic object. The static objects are olive cardboard sphere, olive aluminium cube, purple aluminium cube, purple aluminium sphere, teal aluminium sphere, olive aluminium sphere, The dynamic olive cardboard sphere collides with the olive aluminium cube.It is moving in the Northeast direction and collides with the olive aluminium cube. After the collision the olive cardboard sphere moves in Northeast and olive aluminium cube moves in  direction.  The olive aluminium cube collides with the teal aluminium sphere. The olive aluminium cube moves in the  and the teal aluminium sphere moves in the  direction. The olive aluminium cube collides with the olive aluminium sphere. The olive aluminium cube moves in the  and the olive aluminium sphere moves in the  direction. ",
    "example_47": "Initially there are six objects, five static and one dynamic object. The static objects are teal aluminium cube, olive cardboard sphere, olive aluminium sphere, teal cardboard sphere, purple cardboard sphere, teal cardboard cube, The dynamic olive aluminium sphere collides with the purple cardboard sphere.It is moving in the Northeast direction and collides with the purple cardboard sphere. After the collision the olive aluminium sphere moves in Northeast and purple cardboard sphere moves in  direction.  The purple cardboard sphere collides with the teal cardboard cube. The purple cardboard sphere moves in the  and the teal cardboard cube moves in the  direction. ",
    "example_49": "Initially there are five objects, four static and one dynamic object. The static objects are olive cardboard sphere, teal cardboard sphere, purple aluminium sphere, purple aluminium cube, teal cardboard cube, The dynamic teal cardboard sphere collides with the olive cardboard sphere.It is moving in the Southeast direction and collides with the olive cardboard sphere. After the collision the teal cardboard sphere moves in Southeast and olive cardboard sphere moves in Southeast direction.  The olive cardboard sphere collides with the teal cardboard cube. The olive cardboard sphere moves in the Southeast and the teal cardboard cube moves in the South direction. ",
    "example_5": "Initially there are six objects, five static and one dynamic object. The static objects are teal cardboard cube, olive cardboard sphere, purple aluminium sphere, olive aluminium cube, teal cardboard sphere, teal aluminium sphere, The dynamic olive aluminium cube collides with the teal cardboard sphere.It is moving in the West direction and collides with the teal cardboard sphere. After the collision the olive aluminium cube moves in Southwest and teal cardboard sphere moves in Northwest direction.  ",
    "example_50": "Initially there are five objects, four static and one dynamic object. The static objects are olive aluminium cube, teal cardboard sphere, purple aluminium sphere, olive cardboard cube, olive aluminium sphere, The dynamic teal cardboard sphere collides with the purple aluminium sphere.It is moving in the South direction and collides with the purple aluminium sphere. After the collision the olive aluminium cube moves in  and purple aluminium sphere moves in  direction.  The teal cardboard sphere collides with the olive aluminium cube. The teal cardboard sphere moves in the Southeast and the olive aluminium cube moves in the  direction. The olive aluminium cube collides with the olive cardboard cube. The olive aluminium cube moves in the Southwest and the olive cardboard cube moves in the  direction. ",
    "example_6": "Initially there are five objects, four static and one dynamic object. The static objects are purple cardboard cube, olive aluminium cube, olive cardboard cube, purple cardboard sphere, purple aluminium cube, The dynamic purple aluminium cube collides with the purple cardboard cube.It is moving in the West direction and collides with the purple cardboard cube. After the collision the purple aluminium cube moves in West and purple cardboard sphere moves in West direction.  The purple aluminium cube collides with the olive aluminium cube. The purple aluminium cube moves in the West and the olive aluminium cube moves in the North direction. ",
    "example_7": "Initially there are six objects, five static and one dynamic object. The static objects are olive cardboard sphere, olive cardboard cube, purple cardboard sphere, olive aluminium sphere, purple aluminium cube, teal cardboard sphere, The dynamic purple aluminium cube collides with the olive aluminium sphere.It is moving in the Southeast direction and collides with the olive aluminium sphere. After the collision the purple aluminium cube moves in Southeast and olive aluminium sphere moves in  direction.  The olive aluminium sphere collides with the olive cardboard sphere. The olive aluminium sphere moves in the  and the olive cardboard sphere moves in the  direction. ",
    "example_8": "Initially there are six objects, five static and one dynamic object. The static objects are olive aluminium cube, teal aluminium cube, olive cardboard cube, purple aluminium sphere, teal cardboard sphere, purple cardboard sphere, The dynamic teal aluminium cube collides with the teal cardboard sphere.It is moving in the West direction and collides with the teal cardboard sphere. After the collision the teal aluminium cube moves in South and teal cardboard sphere moves in West direction.  The teal cardboard sphere collides with the purple cardboard sphere. The teal cardboard sphere moves in the West and the purple cardboard sphere moves in the South direction. ",
    "example_9": "Initially there are five objects, four static and one dynamic object. The static objects are olive aluminium sphere, olive aluminium cube, teal cardboard sphere, purple aluminium cube, purple cardboard sphere, The dynamic teal cardboard sphere collides with the purple aluminium cube.It is moving in the North direction and collides with the purple aluminium cube. After the collision the teal cardboard sphere moves in North and purple aluminium cube moves in North direction.  The olive aluminium cube collides with the olive aluminium sphere. The olive aluminium cube moves in the  and the olive aluminium sphere moves in the  direction. The purple aluminium cube collides with the purple cardboard sphere. The purple aluminium cube moves in the Northwest and the purple cardboard sphere moves in the  direction. "
}